Papiea-design.org
#+Title: Papiea Design
#+SETUPFILE: https://fniessen.github.io/org-html-themes/setup/theme-readtheorg.setup
#+Options: H:5
#+HTML_MATHJAX: align: left indent: 5em tagside: left font: Neo-Euler

#+HTML_HEAD: <style>pre.src{background:#343131;color:white;} </style>
#+HTML_HEAD: <style>#content{max-width:70%;} </style>
#+HTML_HEAD: <style>div > ol.org-ol > li {margin-bottom:5px !important; /*color:red !important*/} </style>
#+HTML_HEAD: <style>.nav .timestamp {color: inherit;}</style>

#+OPTIONS: auto-id:t

#+EMAIL: shlomi.vaknin@nutanix.com

#+OPTIONS: prop:("VERSION")

#+HTML: <div class="outline-2" id="meta">
| *Author*   | {{{author}}} ({{{email}}})    |
| *Date*     | 2018-12-06 01:45:27 |
| *Revision* | DRAFT                         |
#+HTML: </div>

Papiea is aimed to be a reference implementation of a [[*Formalities][formal general purpose intent engine]].

* Definitions
  :PROPERTIES:
  :CUSTOM_ID: h-Definitions-669
  :END:
  
  - _Spec_ - a map containing the desired state of a particular entity
  - _Status_ - a map containing the current statue of a particular entity. Always a superset of Spec
  - _Metadata_ - Information of the identity of the entity. Must contain at least =uuid=, =kind= and =specVersion=
  - _Spec version_ - an integer representing the version of the current spec. Updates to spec will
    use this field to ensure that the change will be atomic
  - _Entity_ - The tuple =[Metadata, Spec, Status]=
  - _Kind_ - The "type" of the entity
  - _Diff_ - A difference between the current Status and the most recent desired Spec
  - _Providers_ - Pluggable handlers that can transform an entity from its current state to its desired state
  - _Tasks_ - a mechanism for following the progress of resolving Diffs
* Basic Interfaces
  :PROPERTIES:
  :CUSTOM_ID: h-Basic-Interfaces-186
  :END:
  
  The main concept behind the intentful approach is the ability to know what is the desired state of
  our system and what is the actual current state. Once we have this knowledge, many different kinds
  of engines could be built that would attempt to resolve to tension formed when the intended state,
  termed the =Spec=, is different from the current state of the system, termed the =Status=.

  In Papiea, we use both =Spec= and =Status= to have a complete view of the state of a given entity
  identity, marked by the =Metadata=. The following interfaces capture these most basic concepts.

** Metadata
   :PROPERTIES:
   :ID:       papiea-Metadata-107
   :CUSTOM_ID: h-Metadata-350
   :END:
   
   Metadata has a structured portion which contains fields that defines the identity of a particular
   entity. The fields that identify the entity are:
   - =uuid= - a unique id representing the identity of this entity
   - =kind= - the "type" of this entity
   - =spec_version= - the most up-to-date revision of the spec associated with this entity

   Other fields are also important:
   - =created_at= - logs when this entity was created
   - =delete_at= - annouces if and when will this entity be deleted. If this field is set the entity
     will be deleted by a [[*Cleanup process][Cleanup process]].
    
   #+Name: metadata-struct
   #+BEGIN_SRC typescript
     interface Metadata {
         // Identity fields
         uuid: uuid4;
         kind: string;
         spec_version: number;

         // Additional fields
         created_at: timestamp;
         delete_at: timestamp;
     }
   #+END_SRC
  
** Spec
   :PROPERTIES:
   :ID:       papiea-Spec-833
   :CUSTOM_ID: h-Spec-715
   :END:
   
   The =Spec=, which is the desired state, is simply a json object, or an unstructured map. It can
   and should get a structure when used specifically by any particular entity [[*Kind][Kind]]. However, at the
   engine level, a spec is an unstructured map that can be compared to the mirroring =Status= map to
   find any differences. The structure definintion may change by the provider which defines it, say
   by upgrading to a newer version (See TODO:).

   #+Name: spec-struct
   #+BEGIN_SRC typescript
   type Spec = any;
   #+END_SRC

** Status
   :PROPERTIES:
   :ID:       papiea-Status-714
   :CUSTOM_ID: h-Status-990
   :END:
   
   The =Status=, which is a representation of the true current state of the entity, is also simply a
   json. Its content and structure is a superset of [[*Spec][Spec]], meaning that every field in =Spec= will
   also appear in =Status=, but may contain any extra fields as desired by the provider.

   I am just learning typescript, so still not sure how to express that =Status= is an extension of
   =Spec=, but it should be explicit.

   #+Name: status-struct
   #+BEGIN_SRC typescript
   type Status = any;
   #+END_SRC

** Entity
   :PROPERTIES:
   :ID:       papiea-Entity-682
   :CUSTOM_ID: h-Entity-43
   :END:
   
   An Entity is simply the tuple =(Metadata, Spec, Status)=. It usually denotes a snapshot in time of a particular entity.

   #+Name: entity-struct
   #+BEGIN_SRC typescript
     interface Entity {
       metadata: Metadata;
       spec: Spec;
       status: Status
     }
   #+END_SRC

** Kind
   :PROPERTIES:
   :ID:       papiea-Kind-304
   :CUSTOM_ID: h-Kind-241
   :END:
   
   A Kind is the entity's metadata. It contains an entire description of what the entity is and what
   it may do. This information will be used to provideing full CRUD operation on the entity
   structure along with custom procedures and intentful handlers.

   #+Name: kind-struct
   #+BEGIN_SRC typescript
     // Intentful signature
     type SFS: string;

     type Provider_Callback_URL: string;

     interface Intentful_Signature {
         signature: SFS;
         compiled_signature: any
         function_callback: Provider_Callback_URL;
     }

     // Store a struct description parsed from Swagger Model YAML
     type Data_Description = any;

     // We may want to support different execution strategies. For now we
     // can only halt intentful execution for the duration of the
     // procedural call
     enum Procedural_Execution_Strategy {Halt_Intentful};

     interface Procedural_Signature {
         // The name of the procedure to be exported by the engine.
         name: string;

         // The representation of the data to be passed to this procedure
         argument: Data_Description;

         // The automatically generated validator
         arg_validator_fn: (arg:any)=>boolean;

         // The representation of the data to be returned from this procedure
         result: Data_Description;

         // The automatically generated validator
         result_validator_fn: (res:any)=>boolean;

         // Does the engine pauses all intentful operation invocations for
         // the duration of the procedural call
         execution_strategy: Procedural_Execution_Strategy;

         // Action url into the provider
         procedure_callback: Provider_Callback_URL;
     }

     interface Kind {

         // The name of the kind, and its plural form for proper REST naming
         name: string;
         name_plural: string;

         //// Entity structure
         kind_structure: Data_Description;
         validator_fn: (entity:entity)=>boolean;
         semantic_validator_fn?: Provider_Callback_URL; 

         //// Intentful behavior
         intentful_signatures: map<SFS, Intentful_Signatures>;

         // Every sfs lists the sfs's it has to execute before
         dependency_tree: map<SFS, SFS[]>;

         // The compiled Differ
         differ: Differ;

         //// Procedural behavior
         procedures: map<string, Procedural_Signature>;
     }
   #+END_SRC
   
   A Kind metadata contains the following pieces:
   1. Identification and structure:
      1. a unique name along with its plural form, to generate idiomatic REST API. There may be a
         library function that create plural form, if so it should be used instead.

      2. The description of the data structre defined by this kind. The structure is defined using
         OpenAPI's model format (Swagger), which is parsed into a walkable tree.

      3. A Validator function is generated from this OpenAPI model specification. The purpose of the
         validator function is to ensure that the entity that was sent by the user is syntactically
         (structurally) correct.

      4. an optional semantic validator function is defined as a predicate exposed by the [[*Provider's SDK][Provider's
         SDK]]. It will be used to ensure that the content of the entity is correct.

   2. Intentful behavior
      1. A map from an intentful signature (see [[*SFS - Status Fields Signature][SFS - Status Fields Signature]]) to a structure
         representing the intentful behavior (see TODO:).

      2. Dependency tree between the different intentful behaviors.

      3. Using the two items above, a =Differ= is compiled. The Differ's task is to determine if
         there are any relevant differences between an entity's spec and status (relevant in this
         context means "a diff such that there exists at least one intentful behavior which can
         resolve it").

   3. Procedural behavior
      1. a map from the procedure name to a structure defining that procedure, its input argument
         and output result structures, execution strategy, etc. (see TODO:)
  
** Entity Reference
   :PROPERTIES:
   :ID:       papiea-Entity-Reference-223
   :CUSTOM_ID: h-Entity-Reference-396
   :END:
   
   Entities can point to other entities using a reference. A reference may onlu refers to the
   identity of an entity, and it is the intent engine that returns the entity's most recent spec and
   most current status.

   #+Name: entity-reference-struct
   #+BEGIN_SRC typescript
     interface Entity_Reference  {
         uuid: uuid4;
         kind: string;

         // This field is optional and is only used help the user identify
         // what this reference is pointing to. 
         name?: string;
     }
   #+END_SRC

** Provider description
   :PROPERTIES:
   :ID:       papiea-Provider-description-839
   :CUSTOM_ID: h-Provider-description-189
   :END:
   
   Papiea is extensible by the use of =Providers=.  A Provider defines entities by providing their
   structure, their procedures and intentful behaviors. Along with declaratively define the entity's
   structure, it also enables intentful behaviors by defining how differences between spec and
   status may be resolved. The Provider is pluggable at runtime, and should maintain no internal
   state, which should allow for simpler methods of scaling.

   #+Name: provider-desc-struct
   #+BEGIN_SRC typescript
     interface Provider {
         // A unique identifier where all kinds will be under this prefix
         prefix: string;
         version: Version;
         kinds: Kind[]
     }
   #+END_SRC

   A =Provider Description= contains:
   1. A unique identifier for that provider
   2. A version of that provider
   3. The list of Kinds supported by this provider

* Modules
  :PROPERTIES:
  :CUSTOM_ID: h-Modules-830
  :END:
  
** Databases
   :PROPERTIES:
   :CUSTOM_ID: h-Databases-897
   :END:
   
   #+BEGIN_note
   *Multitenancy*: All databases are aware of tenants. It may be implemented as a column or
   attribute of a table or document, or as a different database with a different connect uri.
   #+END_note
   
*** Status
    :PROPERTIES:
    :CUSTOM_ID: h-Status-781
    :END:
    
    Status database will be a mapping from a metadata (namely, =uuid= and =kind=) to a status json document. 

    It may be implemented using a fast in-memory database, since it may require frequent rapid
    access depending on an entity's kind requirement. It is not required that this database be
    persisted to disk. Its content MUST always be re-acquirable by the providers, simply by asking
    all the providers to list up-to-date status of all objects known to them.

    Each provider for a kind will supply its entity's structure in its YAML.
    
**** Interface
     :PROPERTIES:
     :ID:       papiea-Interface-10
     :CUSTOM_ID: h-Interface-548
     :END:
     
    #+Name: status-db-interface
    #+BEGIN_SRC typescript

      interface Status_DB{

          // Update the status in the status db. As long as the input is
          // correct this always succeeds.
          update_status(entity_ref:Entity_Reference, status:Status):boolean;

          // Gets the status of a particular entity from the db. Returns
          // both current metadata and status of the entity.
          get_status(entity_ref:Entity_Reference):Status;

          // List all status that have their fields match the ones given in
          // fields_map. E.g. we could look for all specs for `vm` kind that
          // have a certain ip:
          // list_status({"metadata": {"kind": "vm"},
          //              "status":   {"ip":   "10.0.0.10"}})
          //
          // We could come up with command such as greater-than etc at some
          // later point, or we could use a similar dsl to mongodb search
          // dsl.
          list_status(fields_map: any): [Entity_Reference, Status][];
      }

    #+END_SRC

*** Spec
    :PROPERTIES:
    :CUSTOM_ID: h-Spec-770
    :END:
    
    Unlike status which can always be fetched from the providers, spec is a record of the user's
    intent and must be persistent. It must also be scalable and highly available. It must have a
    clear notion of atomicity (such as compare-and-set/swap) in order to atomically update spec
    values.

**** Interface
     :PROPERTIES:
     :ID:       papiea-Interface-500
     :CUSTOM_ID: h-Interface-229
     :END:
     
    #+Name: spec-db-interface
    #+BEGIN_SRC go
    
      interface Spec_DB {

          // Tries to update the spec. Succeeds only if the spec_version
          // field in metadata is currently equals to the one on record. The
          // implementation needs to CAS the spec_version to the increment
          // of itself, and return the new metadata with the new
          // spec_version and the new CASed in spec.
          update_spec(entity_ref: Entity_Reference, spec:Spec):[boolean, Metadata, Spec];

          // Get the spec of a particular entity from the db. Returns both
          // current metadata and the spec of that entity.
          get_spec(entity_ref: Entity_Reference):[Metadata, Spec];

          // List all specs that have their fields match the ones given in
          // fields_map. E.g. we could look for all specs for `vm` kind that
          // have a certain ip:
          // list_specs({"metadata": {"kind": "vm"},
          //             "spec":     {"ip":   "10.0.0.10"}})
          //
          // We could come up with command such as greater-than etc at some
          // later point, or we could use a similar dsl to mongodb search
          // dsl.
          list_specs(fields_map: any): [Metadata, Spec][];
      }

    #+END_SRC

*** Providers
    :PROPERTIES:
    :CUSTOM_ID: h-Providers-484
    :END:
    
    Providers database stores all the configurations a provider has registered (encoded in [[*Provider description][Provider
    description]] section). It is used by the engine to record which providers are registered. The
    engine uses this indirectly to initialize all user-facing APIs. This seperation makes it easy to
    scale the engine to many instances.

