Papiea-design.org
**** Interface
     :PROPERTIES:
     :ID:       papiea-Interface-613
     :CUSTOM_ID: h-Interface-104
     :END:
     
    #+Name: providers-db-interface
    #+BEGIN_SRC typescript

      interface Providers_DB {

          // Register a new provider with the intent engine
          register_provider(provider: Provider):void;

          //Upgrade a provider - This should be in the admin?
          //upgrade_provider(from_provider: uuid4, to: providerDescription): Task;
          
          // get a provider
          get_provider(provider_prefix: string, version?: Version): Provider[]

          // List all registered providers
          list_providers(): Provider[]

          // Removes and de-registers a provider from the intent engine
          delete_provider(provider_uuid: uuid4): boolean;
      }

    #+END_SRC

** Dependent services
   :PROPERTIES:
   :CUSTOM_ID: h-Dependent-services-836
   :END:
   
*** Tasks
    :PROPERTIES:
    :CUSTOM_ID: h-Tasks-498
    :END:
    
    Papiea defines a task to be a mechanism that tracks the progress of change towards a
    *particular* spec version. It does not matter how the change took place: through a provider,
    manually or by an error. A task will listen on the relevant status changes and mark off the
    different fields as they get resolved. To get a clearer understanding of the logic underlying
    this please see [[*Intentful Tasks][Intentful Tasks]] section below.

    #+BEGIN_note
    Unlike the traditional definition of a task as a handle to a running process, Papiea does not
    start a particular thread or process to that works on a =Diff=. Instead the task simply listens
    the relevant changes in the entity and tracks its progress. 
    #+END_note
    
**** Interface
     :PROPERTIES:
     :ID:       papiea-Interface-556
     :CUSTOM_ID: h-Interface-766
     :END:
     
     #+Name: task-manager-interface
     #+BEGIN_SRC typescript
       interface Task_Manager {
           wait():any;
           register_delta(Diff[]);
       } 

       function new_task (): Task;
       function new_intentful_task (papiea: Papiea, entity: Entity_Reference, kind: Kind, spec: Spec): Task;
     #+END_SRC
    
     A Task allows you to wait for it to finish.

** Papiea Engine
   :PROPERTIES:
   :CUSTOM_ID: h-Papiea-Engine-337
   :END:
   
*** Initialize
    :PROPERTIES:
    :CUSTOM_ID: h-Initialize-613
    :END:
    
    When Papiea loads up, it needs to initialize its database connections, load the providers,
    generate entity validators and expose CRUD and [[*Procedures][Procedural]] APIs.
   
**** Interface
     :PROPERTIES:
     :ID:       papiea-Interface-228
     :CUSTOM_ID: h-Interface-680
     :END:
     
    #+Name: papiea-interface
    #+BEGIN_SRC typescript
      interface Papiea {

          // api is the mechanism which adds REST endpoints to Papiea.
          api: route;
          prefix: string;

          statusDb: Status_DB;
          specsDb: Spec_DB;
          providersDb: Providers_DB;
      } 
    #+END_SRC

**** Pseudocode
     :PROPERTIES:
     :CUSTOM_ID: h-Pseudocode-305
     :END:
     
     
     #+Name: initialize-papiea-pc
     #+BEGIN_SRC typescript
       // Initialize papiea engine.
       function initialize_papiea(config): Papiea {
           papiea = new Papiea();

           // Load databases, initialize db connections.
           papiea.statusDb = Status_DB.connect(config.status_db);
           papiea.specDb = Spec_DB.connect(config.spec_db);
           papiea.providersDb = Provider_DB.connect(config.provider_db);

           // Sets up the rest api engine.
           papiea.api = new rest.api()

           // Start admin facing apis.
           papiea.create_admin_facing_API();

           // Start providers facing apis.
           papiea.create_providers_facing_API();

           // Start user facing apis.
           papiea.create_user_facing_API();

           return papiea;
       }
     #+END_SRC
*** Exporting APIs
    :PROPERTIES:
    :CUSTOM_ID: h-Exporting-APIs-141
    :END:
    
    Papiea provides three tiers of APIs: Admin, Provider and User facing.

    #+Name: exporting-apis
    #+BEGIN_SRC go
      interface papiea_APIs {
          create_admin_facing_API(papiea:Papiea):void
          create_provider_facing_API(papiea:Papiea):void
          create_user_facing_API(papiea:Papiea):void
      }
    #+END_SRC
    
    Next sections go into greater details into each of the apis.
**** Admin facing APIs
     :PROPERTIES:
     :CUSTOM_ID: h-Admin-facing-APIs-612
     :END:
     
     The admin apis exposed by Papiea are used to manage providers: registrating, upgrading, deleting etc.
***** Pseudocode
      :PROPERTIES:
      :CUSTOM_ID: h-Pseudocode-769
      :END:
      
      #+Name: admin-api-pc
      #+BEGIN_SRC typescript
        function create_admin_facing_API(papiea:Papiea) {
    
            // An example for registring a new provider from a provider description
            papiea.api.POST(papiea.api.prefix+ "/providers", function(req, res) {
                registerOrUpgradeProvider(req.providerDescription);
            });

            // ...
        }
      #+END_SRC
     
**** Provider facing APIs
     :PROPERTIES:
     :CUSTOM_ID: h-Provider-facing-APIs-636
     :END:
     
     Provider has two sets of APIs:
***** Provider's SDK    
      :PROPERTIES:
      :ID:       papiea-Providers-SDK-685
      :CUSTOM_ID: h-Providers-SDK-518
      :END:
      
      This is actually an SDK rather than an API. The distinction is that this is used by the
      providers developers to define and expose behaviors and APIs to the end user.

      This SDK will be availagble in a few languages: Javascript and golang are planned first, but
      more should come.

      The core is the =Provider= abstraction:
      #+Name: provider_sdk_ts_provider_interface
      #+BEGIN_SRC typescript
        // Api for the provider-sdk
        enum Provider_Power {On, Off, Suspended};

        interface Provider {
            new_kind(entity_yaml:Data_Description):Kind;
            version(major:number, minor:number, build: number, extra: string):void;
            power(state: Provider_Power): Provider_Power;
        }
      #+END_SRC

      This allows us to register a new kind (see below), establish a version and change the "Power
      state" of this provider instance. 

      A Kind is added when the user supplies a valid description for the entity handled by this
      kind. Once the kind's entity description is validated, an object of type =Kind= is returned on
      which we can do the following things:
      
      #+Name: provider_sdk_ts_kind_interface
      #+BEGIN_SRC typescript
        enum Procedural_Execution_Strategy {Halt_Intentful};

        interface Kind {

            // Adds an intentful handler. Dispatched based on the signautre passed
            on(signature: string, name: string, rbac: any, handler: (ctx:IntentfulCtx, entity:any)=>void):Intentful_Handler;

            // Convenient functions for constructing/destructing an entity. Could be implemented in terms of "on above"
            on_new(name: string, rbac: any, handler: (ctx:IntentfulCtx, entity:any)=>void):void;
            on_del(name: string, rbac: any, handler: (ctx:IntentfulCtx, entity:any)=>void):void;

            // Adds a procedural behaviour to the entity
            procedure(name: string, rbac: any,
                      strategy: Procedural_Execution_Strategy,
                      input_desc: string,
                      output_desc: string,
                      handler: (ctx:ProceduralCtx, input:any)=>any):void;


            // Visualize all the intentful handlers and their priority
            visualize_intentful_handlers(filename:string):boolean;
        }
      #+END_SRC
      
      We can add an intentful behavior to any set of changes to the entity's fields, either status
      (through a real change to the underlying resource, or spec (through a newly submitted user's
      intent), by declaring a handler using the =on= function.

      We could also register a procedure on that entity. The procedure should not change status in
      ways that may cause a new differences. If that happens, the intent engine will try to
      "resolve" the diff incured by the procedure. A procedure may state what should happen during
      its execution. One such strategy is that no intentful behavior should be handled. If that is
      the case, when the procedure finishes execution, the =Differ= will run again on the entity to
      see if any new diffs are needed to be resolved.

      When we have multiple intentful handlers, it may be desirable to be able to define a
      dependency tree between the different intentful handlers. Which should execute before which:
      
      #+Name: provider_sdk_ts_intentful_handler_interface
      #+BEGIN_SRC typescript
        interface Intentful_Handler {
            // Establishes a dependency tree between the various handlers
            before(...handlers: Intentful_Handler[]):void;
        }
      #+END_SRC

      In this snippet, =h1.before(h2, h3)= would mean that if the =Differ= discovered that both
      =h1=, =h2= and =h3= are possibilities of execution, the handler =h1= should execute first,
      then =h2= and =h3= have no specific ordering. In cases of no order, the handler with the most
      specific signature (i.e. longest) should run first, if both are equal one would be selected at
      random.

      During the execution of an intentful handler, the following functionality could be used:
      #+Name: provider_sdk_ts_intentful_ctx_interface
      #+BEGIN_SRC typescript
        interface IntentfulCtx {
            update_status(metadata: Metadata, status: Status):boolean;
            update_progress(message:string, done_percent:number):boolean;
        }

        // For the time being these are equal. Later they may differ
        type ProceduralCtx=IntentfulCtx;
      #+END_SRC

      During the execution of a handler we may want to set up the status of the entity we are
      working on, or perhaps update the task with our progress (if we have one). 

      I would say that best practice is to have a single =get_status(entity_metadata)= function that
      constructs a full status map out of the real resource, and only call =update_status(metadata,
      get_status(metadata))=, as this will ensure that even in case of a crash the status we saved
      is the exact one that would any way be generated by looking at the real resource.

***** Provider to Papiea APIs
      :PROPERTIES:
      :CUSTOM_ID: h-Provider-to-Papiea-APIs-927
      :END:
      
     Provider facing APIs define the interactions between a provider and the
     intent-engine.  They let the provider register [[*SFS - Status Fields Signature][Status Fields Signature]]
     handlers for intentful apis, and handlers for procedural apis which will be exposed to
     the user.

     Three apis are exposed:
     - =POST "/status"= - sends a voluntary status update regarding an entity. Recieves a context
       which identifies the context in which this was called, the metadata of entity and its new
       status. This functionality is only exposed to the providers, since they are the only view
       Papiea has of the real world. 
     - =POST "/progress= - sends a voluntary progress update for the task, should one exist. 

     #+Name: provider-api-pc
     #+BEGIN_SRC typescript
       function create_provider_facing_API(papiea: Papiea) {
           // Registering Provider Facing APIs.
           api = papieaApis.api
           papieaPrefix = papieaApis.prefix

           // Status update is only exposed to providers. Users can't update status.
           api.POST(papiea+"/status", function(req, res) {
               res.status(statusDb.updateStatus(req.uuid, req.status) ? 200 : 400)
               return res;
           })

           // 
           api.POST(papiea+"/progress", function(req, res) {
               //...
               return res;
           })
       }
     #+END_SRC
