Papiea-design.org
** Intentful Tasks                                          :Continue_Fixing:
   :PROPERTIES:
   :CUSTOM_ID: h-Intentful-Tasks-117
   :END:
   
   Tasks are intentful in our intent engine. This means that a task defines an intent to "get
   notified when a certain change request has completed". 

   A new task may be created in the context of providing a new spec change or a status change. Since
   a spec change is atomically swapped by the engine, a task for a particular spec change may fail
   simply for not being able to atomically perform the swap (such as CAS failures in certain
   models). Once a spec change has been properly and atomically swapped in, the task registers a
   status change listener using [[*SFS - Status Fields Signature][SFS - Status Fields Signature]]. It will listen on all the fields that
   the spec change has requested to change. On every field, the following actions can happen:
   1. The field will get updated to the value that the spec change was requesting
      - Once this happens, this field is marked as successfully being fulfilled, the context of the
        status change may be logged for later auditing and the SFS for this field is stopped
   2. The field will get updated to a value that is *other* than the spec change was requesting
      - If this happens, the task will look to see if the spec version of the entity has increased
        - If it has, this field will be marked as *outdated* and teh SFS for this field is
          stopped. A reference to the outdating spec change may be maintained for later auditing.
        - If it still has the same spec version as the task, the task will not get updated
   
   Using this scheme, the task is said to be complete if there are no more active SFS listeners. It
   may be completed in three ways:
   1. Completed Successfully - All fields were set to the spec value at some point after the spec
      change was issued
   2. Completed Partially - Some fields were set to the spec value, and some were not due to a newer
      spec version
   3. Failed - non of the fields was changed to the given spec values, and there is already a newer
      spec version
   
   As long as there are still active SFS listeners in the task, it will be *pending*. It can show
   progress in terms of how many fields are left of the total fields. The intent engine will have to
   query pending tasks periodically to see if work has to be restarted.
   
   - TODO: What if a before a spec version has made a change to modify
     a field's value, a new spec change arrived that reverted the
     field's value to its value before the first spec change? This
     will cause status to never be updated because there is no
     difference between spec and status, but there is a task still
     listening.. Need to think about this
   
   #+Name: task-pc
   #+BEGIN_SRC typescript
     function new_intentful_task(papiea: Papiea, entity: Entity_Reference, kind: Kind, spec: Spec): Task {
         // Get the status of the entity we are trying to change.
         status = papiea.status_db.get_status(entity);

         // Calculate the delta between the spec and the status. calc_delta
         // will take into consideration all registered SFS for the
         // entity's kind in order to know how to diff on vector
         // elements. See more details in calc_delta. Each delta found will
         // record the corresponding SFS that could is registered which
         // should be able to resolve the diff
         deltas = kind.differ.all_difs(entity, spec, status);

         // we are the task
         task = new Task();

         // Register all the relevant deltas we could listen on
         task.register_delta(delta);

         for (field in deltaho) {
             // TBD: define on, define context
             fieldListener = papiea.on(field.sfs, func(context, updatedEntity entityReference, status status){
                 newValue = status.get(field.path)
                 specValue = spec.get(field.path)

                 if (newValue == specValue) {
                     // Update the task that this field in the delta is a success
                     task.updateFieldStatus(field, "Success")

                     // Stopping this listener
                     task.removeFieldListener(this)
                 }
                 else if (entity.metadata.specVersion == updatedEntity.metadata.specVersion) {
                     // We got a different value, but still on the same spec version, dont do anything yet
                     // Add to audit
                     // Perhaps note this in some TTL
                 }
                 else {
                     // We got a different value AND the spec version has increased (it can only increase)

                     // update the task that this field is outdated by a particular spec version
                     task.updateFieldStatus(field, "Outdated by " + updatedEntity.metadata.specVersion)

                     // Stopping this listener
                     task.removeFieldListener(this)
                 }

                 task.verifyCompletness()
             })

             task.addFieldListener(fieldListener)
         }
     }

     func (papiea papiea) verifyCompletness() {
         if (task.noMoreFieldListeners()) {
             if (task.specDidNotRegister()) {
                 task.setStatus("Spec did not manage to be atomically committed. Try again.")
             }
             else if (task.hasFailedFields()) {
                 task.setStatus("Partially Completed")
             } else {
                 task.setStatus("Completed Successfully")
             }
         }
     }
   #+END_SRC
** Provider Library
   :PROPERTIES:
   :CUSTOM_ID: h-Provider-Library-729
   :END:
   
*** Define Entity Model
    :PROPERTIES:
    :CUSTOM_ID: h-Define-Entity-Model-393
    :END:
    
**** YAML
     :PROPERTIES:
     :CUSTOM_ID: h-YAML-342
     :END:
     
**** CRUD
     :PROPERTIES:
     :CUSTOM_ID: h-CRUD-68
     :END:
     
*** Initialize
    :PROPERTIES:
    :CUSTOM_ID: h-Initialize-384
    :END:
    
*** Callback Mechanism
    :PROPERTIES:
    :CUSTOM_ID: h-Callback-Mechanism-760
    :END:
    
*** Running Effect Validator
    :PROPERTIES:
    :CUSTOM_ID: h-Running-Effect-Validator-934
    :END:
    
*** Status Changes Handlers
    :PROPERTIES:
    :CUSTOM_ID: h-Status-Changes-Handlers-305
    :END:
    
**** Registring
     :PROPERTIES:
     :CUSTOM_ID: h-Registring-364
     :END:
     
**** Running using context
     :PROPERTIES:
     :CUSTOM_ID: h-Running-using-context-1
     :END:
     
*** Procedures
    :PROPERTIES:
    :CUSTOM_ID: h-Procedures-910
    :END:
    
**** Registring
     :PROPERTIES:
     :CUSTOM_ID: h-Registring-726
     :END:
     
**** Running using context
     :PROPERTIES:
     :CUSTOM_ID: h-Running-using-context-963
     :END:
     
*** Example Provider
    :PROPERTIES:
    :CUSTOM_ID: h-Example-Provider-853
    :END:
    
* Full files
  :PROPERTIES:
  :CUSTOM_ID: h-Full-files-475
  :END:
  
** Core definitions
   :PROPERTIES:
   :CUSTOM_ID: h-Core-definitions-249
   :END:
   
*** /src/core.ts
    :PROPERTIES:
    :CUSTOM_ID: h-srccorets-990
    :END:
    
    #+BEGIN_SRC typescript :noweb yes :tangle src/core.ts :exports code :mkdirp yes :comments noweb
    
    <<metadata-struct>>

    <<spec-struct>>

    <<status-struct>>

    <<entity-struct>>

    <<kind-struct>>

    <<entity-reference-struct>>

    <<provider-desc-struct>>

    <<papiea-interface>>

    #+END_SRC

** Databases
   :PROPERTIES:
   :CUSTOM_ID: h-Databases-346
   :END:
   
*** /src/databases/spec_db_interface.ts
    :PROPERTIES:
    :CUSTOM_ID: h-srcdatabasesspec_db_interfacets-571
    :END:
    
    #+BEGIN_SRC typescript :noweb yes :tangle src/databases/spec_db_interface.ts :exports code :mkdirp yes :comments noweb
    <<spec-db-interface>>
    #+END_SRC

*** /src/databases/status_db_interface.ts
    :PROPERTIES:
    :CUSTOM_ID: h-srcdatabasesstatus_db_interfacets-127
    :END:
    
    #+BEGIN_SRC typescript :noweb yes :tangle src/databases/status_db_interface.ts :exports code :mkdirp yes :comments noweb
    <<status-db-interface>>
    #+END_SRC

*** /src/databases/providers_db_interface.ts
    :PROPERTIES:
    :CUSTOM_ID: h-srcdatabasesproviders_db_interfacets-582
    :END:
    
    #+BEGIN_SRC typescript :noweb yes :tangle src/databases/providers_db_interface.ts :exports code :mkdirp yes :comments noweb
    <<providers-db-interface>>
    #+END_SRC

** Differ   
   :PROPERTIES:
   :CUSTOM_ID: h-Differ-646
   :END:
   
*** /src/intentful_core/differ_interface.ts
    :PROPERTIES:
    :CUSTOM_ID: h-srcintentful_corediffer_interfacets-83
    :END:
    
    #+BEGIN_SRC typescript :noweb yes :tangle src/intentful_core/differ_interface.ts :exports code :mkdirp yes :comments noweb
    <<Differ-interface>>

    <<Diff-interface>>
    #+END_SRC
** Tasks
   :PROPERTIES:
   :CUSTOM_ID: h-Tasks-912
   :END:
   
*** /src/tasks/task_manager_interface.ts
    :PROPERTIES:
    :CUSTOM_ID: h-srctaskstask_manager_interfacets-833
    :END:
    
    #+BEGIN_SRC typescript :noweb yes :tangle src/tasks/task_manager_interface.ts :exports code :mkdirp yes :comments noweb
    <<task-manager-interface>>
    #+END_SRC

** Provider SDK
   :PROPERTIES:
   :CUSTOM_ID: h-Provider-SDK-909
   :END:
   
*** Typescript: /src/provider_sdk/typescript_sdk_interface
    :PROPERTIES:
    :CUSTOM_ID: h-Typescript:-srcprovider_sdktypescript_sdk_interface-851
    :END:
    
    #+BEGIN_SRC typescript :noweb yes :tangle src/provider_sdk/typescript_sdk_interface.ts :exports code :mkdirp yes :comments noweb
    <<provider_sdk_ts_provider_interface>>

    <<provider_sdk_ts_kind_interface>>

    <<provider_sdk_ts_intentful_handler_interface>>

    <<provider_sdk_ts_intentful_ctx_interface>>
    #+END_SRC


** /src-go/papiea/engine/core.go
   :PROPERTIES:
   :CUSTOM_ID: h-src-gopapieaenginecorego-857
   :END:
   
   # :noweb yes :tangle src-go/papiea/engine/core.go :exports code :mkdirp yes
   #+BEGIN_SRC go 
   // All our structs and interfaces:
   
   // Untyped json for now. We should probably use some better library for that:
   <<untyped-json-type>>

   // Spec, status and metadata:
   <<spec-struct>>
   <<status-struct>>
   <<metadata-struct>>
   
   // Kind and providers:
   <<kind-struct>>
   <<provider-desc-struct>>

   // Define our database interfaces:
   <<stataus-db-interface>>
   <<spec-db-interface>>
   <<providers-db-interface>>
   
   // Services interfaces:
   <<task-interface>>

   // Provider APIs signatures.
   // Status Fields Signatures:
   <<sfs-signature>>

   // Procedure Signatures:
   <<procedure-signature>>

   // Provider handlers:
   <<provider-handler-interface>>

   // Papiea:
   <<initialize-papiea>>
   <<papiea_api_ctx>>
   <<papiea_apis>>
   
   #+END_SRC
** /src-go/papiea/engine/server.go
   :PROPERTIES:
   :CUSTOM_ID: h-src-gopapieaengineservergo-864
   :END:
   
  # :noweb yes :tangle src-go/papiea/engine/server.go :exports code :mkdirp yes
  #+BEGIN_SRC go 
    #import stuff

    // Initialize Papiea.
    <<initialize-papiea-pc>>

    // Admin Facing APIs:
    <<admin-api-pc>>
    
    // Provider Facing APIS:
    <<provider-api-pc>>
    
    // User Facing APIs:
    <<user-api-pc>>
  #+END_SRC
  
** /src-go/papiea/engine/provider.go 
   :PROPERTIES:
   :CUSTOM_ID: h-src-gopapieaengineprovidergo-185
   :END:
   
   # :noweb yes :tangle src-go/papiea/engine/provider.go :exports code :mkdirp yes
   #+BEGIN_SRC go 
   // Provider handler registration:
   <<provider-handler-pc>>
   #+END_SRC

** /src-go/papiea/engine/tasks.go
   :PROPERTIES:
   :CUSTOM_ID: h-src-gopapieaenginetasksgo-950
   :END:
   
   # :noweb yes :tangle src-go/papiea/engine/tasks.go :exports code :mkdirp yes
   #+BEGIN_SRC go 
   // Provider handler registration:
   <<task-pc>>
   #+END_SRC

