src/provider_sdk/typescript_sdk_interface.ts
// Typescript: /src/provider_sdk/typescript_sdk_interface:1 ends here
